//var Sequelize = require('sequelize');
//var db = require('../models/dbc.js');
var tables = require('../models/tabled.js');

var Unit = tables.Unit;

Unit.sync({force: true}).then(function () {
  // Table created
  return Unit.bulkCreate([
    {
      htcode: '10576-99', 
      name: '系统管理组', 
      status: true,
      role: '管理员'
    },
    {
      htcode: '10576-02-01-05-04', 
      name: '韶关学院-信息科学与工程学院-计算机科学技术系', 
      role: '教师'
    },
    {
      htcode: '10576-01-01-05-2012-01-01', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-1班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2012-01-02', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-2班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2012-01-03', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-3班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2012-01-04', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-4班',
      role: '学生'
    },
    
    /***********************************************/
    
    {
      htcode: '10576-01-01-05-2013-01-01', 
      name: '韶关学院-信息科学与工程学院-2013级-计算机科学技术专业-1班', 
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2013-01-02', 
      name: '韶关学院-信息科学与工程学院-2013级-计算机科学技术专业-2班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-01', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-1班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-02', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-2班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2015-01-01', 
      name: '韶关学院-信息科学与工程学院-2015级-计算机科学技术专业-1班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2015-01-02', 
      name: '韶关学院-信息科学与工程学院-2015级-计算机科学技术专业-2班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2013-01-06', 
      name: '韶关学院-信息科学与工程学院-2013级-计算机科学技术专业-B班',
      role: '学生'
    },
  {
      htcode: '10576-01-01-05-2013-01-05', 
      name: '韶关学院-信息科学与工程学院-2013级-计算机科学技术专业-A班',
      role: '学生'
    },
   {
      htcode: '10576-01-01-05-2012-01-06', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-B班',
      role: '学生'
    },
   {
      htcode: '10576-01-01-05-2012-01-05', 
      name: '韶关学院-信息科学与工程学院-2012级-计算机科学技术专业-A班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2015-01-04', 
      name: '韶关学院-信息科学与工程学院-2015级-计算机科学技术专业-4班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2015-01-03', 
      name: '韶关学院-信息科学与工程学院-2015级-计算机科学技术专业-3班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-04', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-4班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-03', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-3班',
      role: '学生'
    },
  {
      htcode: '10576-01-01-05-2015-01-05', 
      name: '韶关学院-信息科学与工程学院-2015级-计算机科学技术专业-A班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2013-01-03', 
      name: '韶关学院-信息科学与工程学院-2013级-计算机科学技术专业-3班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-05', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-A班',
      role: '学生'
    },
    {
      htcode: '10576-01-01-05-2014-01-06', 
      name: '韶关学院-信息科学与工程学院-2014级-计算机科学技术专业-B班',
      role: '学生'
    }
  ]);
});
